function SmartLilly(arg_number){
    let age = arg_number[0];
    let washinMachinePrice = arg_number[1];
    let toyPrice = arg_number[2];
    let money=0.00;
    let toys =0;
    let moneyGift=10;
    let brotherCut = 1;
    let result;

    for(let i =1;i<=age;i++){
        if(i%2==0){
            money+=moneyGift;
            moneyGift+=10;
            money-=brotherCut;
        }
        else{
            toys +=1;
        }
    }
    money+=(toys*toyPrice);
    if(washinMachinePrice<=money){
        result = `Yes! ${(Math.abs(washinMachinePrice-money)).toFixed(2)}`;
    }
    else {
        result = `No! ${(Math.abs(washinMachinePrice-money)).toFixed(2)}`;
    }
    console.log(result);

}

SmartLilly([10, 170.00, 6]);
SmartLilly([21, 1570.98, 3]);




// Задача: умната Лили
// Лили вече е на N години. За всеки свой рожден ден тя получава подарък. За нечетните рождени дни (1, 3, 5, …, n) получава играчки, а за всеки четен (2, 4, 6, …, n) получава пари. За втория рожден ден получава 10.00 лв., като сумата се увеличава с 10.00 лв. за всеки следващ четен рожден ден (2 -> 10, 4 -> 20, 6 -> 30 и т.н.). През годините Лили тайно е спестявала парите. Братът на Лили, в годините, които тя получава пари, взима по 1.00 лев от тях. Лили продала играчките, получени през годините, всяка за P лева и добавила сумата към спестените пари. С парите искала да си купи пералня за X лева. Напишете програма, която да пресмята колко пари е събрала и дали ѝ стигат да купи пералня.
// Входни данни
// Програмата прочита 3 числа (аргумента), въведени от потребителя, на отделни редове:
// • Възрастта на Лили – цяло число в интервала [1 … 77].
// • Цената на пералнята – число в интервала [1.00 … 10 000.00].
// • Единична цена на играчка – цяло число в интервала [0 … 40].
// Изходни данни
// Да се отпечата на конзолата един ред:
// • Ако парите на Лили са достатъчни:
// o "Yes! {N}" – където N е остатъка пари след покупката
// • Ако парите не са достатъчни:
// o "No! {M}" – където M е сумата, която не достига
// • Числата N и M трябва да са форматирани до втория знак след десетичната точка.
// Примерен вход и изход

// Вход Изход Коментари 10 170.00 6 Yes! 5.00 Първи рожден ден получава играчка; 2ри -> 10 лв.; 3ти -> играчка; 4ти -> 10 + 10 = 20 лв.; 5ти -> играчка; 6ти -> 20 + 10 = 30 лв.; 7ми -> играчка; 8ми -> 30 + 10 = 40 лв.; 9ти -> играчка; 10ти -> 40 + 10 = 50 лв. Спестила е -> 10 + 20 + 30 + 40 + 50 = 150 лв.. Продала е 5 играчки по 6 лв. = 30 лв.. Брат ѝ взел 5 пъти по 1 лев = 5 лв. Остават -> 150 + 30 – 5 = 175 лв. 175 >= 170(цената на пералнята) успяла е да я купи и са ѝ останали 175-170 = 5 лв.
// Вход Изход Коментари
// 21 1570.98 3
// No! 997.98
// Спестила е 550 лв.. Продала е 11 играчки по 3 лв. = 33 лв. Брат ѝ взимал 10 години по 1 лев = 10лв. Останали 550 + 33 – 10 = 573 лв. 573 < 1570.98 – не е успяла да купи пералня. Не ѝ достигат 1570.98–573 = 997.98 лв
