function Hospital(arg_numbers){
    let medics = 7;
    let days = arg_numbers[0];
    let checked=0;
    let unchecked = 0;

    for(let i =1;i<=days;i++){
        if(i%3==0 && unchecked>checked){
            medics+=1;
        }
        let  patientsRemaining=arg_numbers[i]-medics;
        if(patientsRemaining>=0){
            unchecked +=patientsRemaining;
            checked+=medics;
        }
        else {
            checked+=arg_numbers[i];
        }

    }


    console.log(`Treated patients: ${checked}.`);
    console.log(`Untreated patients: ${unchecked}.`);
}


Hospital([4,7,27,9,1]);
Hospital([6, 25, 25, 25, 25, 25, 2]);
Hospital([3, 7, 7, 7]);
Hospital([4, 7, 27, 9, 1]);



// Задача: болница
// За даден период от време, всеки ден в болницата пристигат пациенти за преглед. Тя разполага първоначално със 7 лекари. Всеки лекар може да преглежда само по един пациент на ден, но понякога има недостиг на лекари, затова останалите
// пациенти се изпращат в други болници. Всеки трети ден болницата прави изчисления и ако броят на непрегледаните пациенти е по-голям от броя на прегледаните, се назначава още един лекар. Като назначаването става преди да започне приемът на пациенти за деня.
// Напишете програма, която изчислява за дадения период броя на прегледаните и непрегледаните пациенти.
// Входни данни
// На първия ред (аргумент) от входа стои цяло число в интервала [1 … 1000] - периода, за който трябва да направите изчисления . На следващите редове (аргумента) стои по едно цяло число в интервала [1 … 10 000] – броя пациенти, които пристигат за преглед за текущия ден.
// Изходни данни
// Да се отпечатат на конзолата 2 реда:
// • На първия ред: "Treated patients: {брой прегледани пациенти}."
// • На втория ред: "Untreated patients: {брой непрегледани пациенти}."
// Примерен вход и изход
// Вход Изход Вход Изход 6 25 25 25 25 25 2 Treated patients: 40. Untreated patients: 87. 3 7 7 7 Treated patients: 21. Untreated patients: 0.
// Вход Изход Обяснения 4 7 27 9 1 Treated patients: 23. Untreated patients: 21. 1 ден: 7 прегледани и 0 непрегледани пациента за деня 2 ден: 7 прегледани и 20 непрегледани пациента за деня 3 ден: До момента прегледаните пациенти са общо 14, а непрегледаните – 20 –> Назначава се нов лекар –> 8 прегледани и 1 непрегледан пациент за деня 4 ден: 1 прегледан и 0 непрегледани пациен-та за деня Общо: 23 прегледани и 21 непрегледани пациенти.
