function Division(arg_numbers){
    let count = arg_numbers[0];
    let p1 = 0.00;
    let p2 = 0.00;
    let p3 = 0.00;
    for(let i = 1;i<=arg_numbers.length;i++){
        if(arg_numbers[i]%2==0){
            p1++;
        }
        if(arg_numbers[i]%3==0){
            p2++;
        }
        if(arg_numbers[i]%4==0){
            p3++;
        }
    }
    console.log(((p1/count)*100).toFixed(2)+"%");
    console.log(((p2/count)*100).toFixed(2)+"%");
    console.log(((p3/count)*100).toFixed(2)+"%");
    
}

Division([10, 680, 2 ,600, 200, 800 ,799, 199, 46 ,128, 65]);
Division([3, 3, 6 ,9]);
Division([1, 12]);



// Задача: деление без остатък
// Дадени са n цели числа в интервала [1 … 1000]. От тях някакъв процент p1 се делят без остатък на 2, процент p2 се делят без остатък на 3, процент p3 се делят без остатък на 4. Да се напише програма, която изчислява и отпечатва процентите p1, p2 и p3. Пример: имаме n = 10 числа: 680, 2, 600, 200, 800, 799, 199, 46, 128, 65. Получаваме следното разпределение и визуализация: Деление без остатък на: Числа Брой Процент 2 680, 2, 600, 200, 800, 46, 128 7 p1 = (7 / 10) * 100 = 70.00% 3 600 1 p2 = (1 / 10) * 100 = 10.00% 4 680, 600, 200, 800, 128 5 p3 = (5 / 10) * 100 = 50.00%
// Примерен вход и изход
// Вход Изход
// Вход Изход
// Вход Изход 10 680 2 600 200 800 799 199 46 128 65 70.00% 10.00% 50.00%
// 3 3 6 9 33.33% 100.00% 0.00%
// 1 12 100.00% 100.00% 100.00%
// Входни данни
// На първия ред (аргумент) от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа. На следващите n реда стои по едно цяло число в интервала [1 … 1000] – числата които да бъдат проверени на колко се делят.7
// Изходни данни
// Да се отпечатат на конзолата 3 реда, всеки от които съдържа процент между 0% и 100%, с точност две цифри след десетичния знак, например 25.00%, 66.67%, 57.14%.
// • На първия ред – процентът на числата, които се делят на 2.
// • На втория ред – процентът на числата, които се делят на 3.
// • На третия ред – процентът на числата, които се делят на 4.