function Logistics(arg_numbers){
    cargoCount = arg_numbers[0];
    let bus=0;
    let truck=0;
    let train=0;
    let tones=0;
    let averagePrice;

    for(let i=1;i<arg_numbers.length;i++){
        if(arg_numbers[i]<=3){
            bus+=arg_numbers[i];
        }
        else if(arg_numbers[i]<=11){
            truck+=arg_numbers[i];
        }
        else{
            train+=arg_numbers[i];
        }
        tones+=arg_numbers[i];
    }
    averagePrice=(bus*200+truck*175+train*120)/tones;
    console.log(averagePrice.toFixed(2));
    console.log((bus/tones*100).toFixed(2)+"%");
    console.log((truck/tones*100).toFixed(2)+"%");
    console.log((train/tones*100).toFixed(2)+"%");
}



Logistics([4, 1, 5, 16, 3]);
Logistics([5, 2, 10, 20, 1, 7]);
Logistics([4, 53, 7, 56, 999]);





// Задача: логистика
// Отговаряте за логистиката на различни товари. В зависимост от теглото на всеки товар е нужно различно превозно средство и струва различна цена на тон:
// • До 3 тона – микробус (200 лева на тон).
// • От над 3 и до 11 тона – камион (175 лева на тон).
// • Над 11 тона – влак (120 лева на тон).
// Вашата задача е да изчислите средната цена на тон превозен товар, както и колко процента от товара се превозват с всяко превозно средство.
// Входни данни
// Програмата чете поредица от числа (аргумента):
// • На първия ред (аргумент): брой на товарите за превоз – цяло число в интервала [1 … 1000].
// • На всеки следващ ред (аргумент) се подава тонажът на поредния товар – цяло число в интервала [1 … 1000].
// Изходни данни
// Да се отпечатат на конзолата 4 реда, както следва:
// • Ред #1 – средната цена на тон превозен товар (закръглена до втория знак след десетичната точка).
// • Ред #2 – процентът товар, превозван с микробус (между 0.00% и 100.00%, закръглен до втория знак след десетичната точка).
// • Ред #3 – процентът товар, превозвани с камион (между 0.00% и 100.00%).
// • Ред #4 – процентът товар, превозвани с влак (между 0.00% и 100.00%).
// Примерен вход и изход
// Вход Изход Обяснения 4 1 5 16 3 143.80 16.00% 20.00% 64.00% С микробус се превозват два от товарите 1 + 3, общо 4 тона. С камион се превозва един от товарите: 5 тона. С влак се превозва един от товарите: 16 тона. Сумата от всички товари е: 1 + 5 + 16 + 3 = 25 тона. Процент товар с микробус: 4/25*100 = 16.00% Процент товар с камион: 5/25*100 = 20.00% Процент товар с влак: 16/25*100 = 64.00% Средна цена на тон превозен товар: (4 * 200 + 5 * 175 + 16 * 120) / 25 = 143.80
// Вход Изход Вход Изход 5 2 10 20 1 7 149.38 7.50% 42.50% 50.00% 4 53 7 56 999 120.35 0.00% 0.63% 99.37%

