function SumNumbers(arg_input){
    let sum=0;
    for(let i = 1; i<arg_input.length;i++){
        sum+=arg_input[i];
    }
    console.log(sum);
}


SumNumbers([2,10,20]);
SumNumbers([3,-10,-20,-30]);
SumNumbers([4,45,-20,7,11]);
SumNumbers([1,999]);
SumNumbers([0,0]);

//Пример: сумиране на числа Да се напише програма, която въвежда n цели числа и ги сумира.
//• От първия ред на входа се въвежда броят числа n. • От следващите n реда се въвежда по едно число.
//Числата се сумират и накрая се отпечатва резултатът.
//Вход 2, 10, 20
//Изход 30


//Вход 3, -10, -20, -30
//Изход -60
//Вход 4, 45,-20, 7 , 11
//Изход 43
//Вход 1, 999
//Изход 999
//Вход 0
//Изход 0